src/Catalogs/кс_Сценарии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>кс_Сценарии</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеглЗаданияИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеглЗаданияАктивность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Скрипты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Скрипт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗД_Скрипты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Параметр</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПараметрЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.зд_ТипПараметра</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Доступ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/кс_Сценарии/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;  
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	
	УстановитьСостояниеРЗ(Отказ);

КонецПроцедуры
	  
	  
Процедура УстановитьСостояниеРЗ(Отказ)
	Перем НастройкиРЗ;   
	Перем Интерактивно;   
	
	ДополнительныеСвойства.Свойство("Интерактивно", Интерактивно);
	
	Если Интерактивно<>Истина Тогда
		Возврат;
	КонецЕсли;
	
	
	ПустойУИД = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"); 
	ДополнительныеСвойства.Свойство("НастройкиРЗ", НастройкиРЗ);
	
	Если РеглЗаданияАктивность   Тогда
		
		СсылкаОбъекта = Ссылка;
		Если ЭтоНовый() Тогда
			СсылкаОбъекта = ПолучитьСсылкуНового();
			Если НЕ ЗначениеЗаполнено(СсылкаОбъекта) Тогда
				СсылкаОбъекта = Справочники.кс_Сценарии.ПолучитьСсылку();
				УстановитьСсылкуНового(СсылкаОбъекта);
			КонецЕсли;
		КонецЕсли; 
		
		НаименованиеРЗ = "Сценарий: "+Наименование;
		Если РеглЗаданияИдентификатор = ПустойУИД Тогда
			РЗ = РегламентныеЗадания.СоздатьРегламентноеЗадание("ВыполнениеСкриптов");			
		Иначе
			РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РеглЗаданияИдентификатор);
			Если РЗ = Неопределено Тогда
				РЗ = РегламентныеЗадания.СоздатьРегламентноеЗадание("ВыполнениеСкриптов");
			КонецЕсли;
		КонецЕсли;
				
		РЗ.Расписание = НастройкиРЗ;
		РЗ.Наименование = НаименованиеРЗ;
		РЗ.Использование = Истина;
		РЗ.Параметры.Очистить();
		РЗ.Параметры.Добавить(СсылкаОбъекта);
		РЗ.Записать();
		
		РеглЗаданияИдентификатор = РЗ.УникальныйИдентификатор;
		
	Иначе
		Если РеглЗаданияИдентификатор <> ПустойУИД Тогда
			РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РеглЗаданияИдентификатор);
			Если РЗ <> Неопределено Тогда
				РЗ.Удалить();
			КонецЕсли;
			РеглЗаданияИдентификатор = ПустойУИД;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры   

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	РеглЗаданияАктивность = Ложь;  
	РеглЗаданияИдентификатор = новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры
